#  -*- coding:utf-8 -*-

news_title_list = [["新闻1", "新闻2"], ["新闻3", "新闻4", "新闻5"]]

news_title_list2 = []
for value in news_title_list:
    news_title_list2.extend(value)

print(news_title_list2)

articles = [{"title": "新闻1"}, {"title": "新闻1"}, {"title": "新闻2"}, {"title": "新闻3"}, {"title": "新闻1"}]
articles_set = set()

for value in articles:
    articles_set.add(value.get("title"))

new_articles = []
for value in articles_set:
    new_articles.append({"title": value})
print(new_articles)

sequences = [
   '流水前波让后波', '不是一番梅彻骨', '须教自我胸中出', '古人学问无遗力', '流水落花春去也', '熟读深思子自知', '不薄今人爱古人', '身无彩凤双飞翼', '东风无力百花残', '也有春风摆动时', '病树前头万木春', '坐驰可以役万里', '一寸光阴一寸金', '听唱新翻杨柳枝', '苍龙日暮还行雨', '只是当时已惘然', '天下谁人不识君', '同是天涯沦落人', '秋月春风等闲度', '不拘一格降人才', '替人垂泪到天明', '不及汪伦送我情', '杜诗韩集愁来读', '古人学问无遗力', '此时无声胜有声', '采得百花成蜜后',
   '为赋新词强说愁', '不听陈言只听天', '除却巫山不是云', '在天愿作比翼鸟', '门外若无南北路', '少壮工夫老始成', '沉舟侧畔千帆过', '此时无声胜有声', '岁岁年年人不同', '只缘身在最高层', '友如作画须求淡', '逢人渐觉乡音异', '两情若是久长时', '各领风骚数百年', '试玉要烧三日满', '寅父犹能畏后生', '春蚕到死丝方尽', '立志欲坚不欲锐', '坐驰可以役万里', '一片冰心在玉壶', '春江秋月冬冰雪', '别时容易见时难', '新松恨不高千尺', '各领风骚数百年', '千载谁堪伯仲间', '寒梅着花未? ',
   '衣带渐宽终不悔', '爱材养育谁复议', '今见功名胜古人', '不是虚心岂得贤', '今见功名胜古人', '此情可待成追忆', '好诗不过近人情', '人生七十古来稀', '两情若是久长时', '似倩麻姑痒处抓', '独上江楼思渺然', '抽刀断水水更流', '一语天然万古新', '片言可以明百意', '切忌随人脚后行', '悲莫悲兮生别离', '独上江楼思渺然', '少年心事当拂云', '不听陈言只听天', '不废江河万古流', '悲莫悲兮生别离', '不拘一格降人才', '同是天涯沦落人', '唯有门前镜湖水', '上穷碧落下黄泉', '十年一觉扬州梦',
   '为人性僻耽佳句', '要留青白在人间', '天下谁人不识君', '绝知此事要躬行', '蜡炬成灰泪始干', '假金方用真金镀', '年年岁岁花相似', '为谁辛苦为谁甜', '也有春风摆动时', '只留清气满乾坤', '若是真金不镀金', '今夜月明人尽望', '为伊消得人憔悴', '天生我材必有用', '只缘身在此山中', '古来青史谁不见', '只看后浪催前浪', '假金方用真金镀', '莫愁前路无知己', '预支五百年新意', '此诀传来自放翁', '上穷碧落下黄泉', '时人莫小池中水', '悄立市桥人不识', '为谁辛苦为谁甜', '今日花开已一年',
   '逢人渐觉乡音异', '赢得青楼薄幸名', '春风不改旧时波', '预支五百年新意', '我劝天公重抖擞', '举杯消愁愁更愁', '桃李春风一杯酒', '不废江河万古流', '苦恨年年压金线', '一湾死水全无浪', '万物兴歇皆自然', '却看妻子愁何在', '今日花开已一年', '不畏浮云遮望眼', '问渠那得清如许', '去年今日此门中', '一诗千改始心安', '天若有情天亦老', '一语天然万古新', '西出阳关无故人', '古来青史谁不见', '任他明月下西楼', '人间应免别离愁', '路漫漫其修远兮', '千磨万击还坚劲', '天籁自鸣天趣足',
   '豪华落尽见真淳', '人生结交在终结', '一日看尽长安花', '蜡炬成灰泪始干', '为伊消得人憔悴', '剪裁妙处非刀尺', '不知秋思落谁家', '从此无心爱良夜', '切忌随人脚后行', '人间应免别离愁', '粉身碎骨浑不怕', '江山代有才人出', '近水楼台先得月', '举世皆浊我独清', '天机云锦用在我', '好诗不过近人情', '漫卷诗书喜欲狂', '曾经沧海难为水', '千金散尽还复来', '却恨莺声似故山', '不是虚心岂得贤', '人到愁来无处会', '只是当时已惘然', '从来好事天生俭', '白日放歌须纵酒', '故书不厌百回读',
   '近水楼台先得月', '此恨绵绵无绝期', '人中难得九方皋', '万物兴歇皆自然', '自古瓜儿苦后甜', '人生结交在终结', '蜡烛有心还惜别', '又岂在朝朝暮暮', '少壮工夫老始成', '丈夫未可轻少年', '门外若无南北路', '恶竹应须斩万竿', '纸上得来终觉浅', '楚王台谢空山丘', '出师一表真名世', '相逢何必曾相识', '山外青山楼外楼', '少年辛苦终身事', '一星如月看多时', '天籁自鸣天趣足', '吹尽狂沙始到金', '辨材须待七年期', '俯仰随人亦可怜', '山外青山楼外楼', '东边日出西边雨', '到了千年又觉陈',
'每逢佳节倍思亲', '不识庐山真面目', '赢得青楼薄幸名', '寅父犹能畏后生', '老树春深更著花', '莫向光阴惰寸功', '任尔东西南北风']

keyword = "风花雪月"
keyword_list = list(keyword)
new_sequences = []
for line in sequences:
    for c in keyword_list:
        index = line.find(c)
        if index != -1:
            new_sequences.append(line)
            break

print(new_sequences)

content = "流水前波让后波不是123一番梅彻骨须教自我胸中出古人学问无遗力流水落花春去也熟读深思子自知不薄567今人爱古人身无彩凤双飞翼东风无力百花残也有春风摆动时病树前头万木春坐驰可以役万456里一寸光阴一寸金听唱新翻杨柳枝苍龙日暮还行雨只是当时已惘然天下谁人不识君同是天涯沦落人秋月春风等闲度不拘一格降人才666替人垂泪到天明不及汪伦送我情杜诗235韩集愁来读古人学问无遗力此时无声胜有声采得百花成蜜930后为赋新词强说愁不听陈言只听天除却巫山不是云在天愿作比翼888鸟门外若无南北路少壮工夫老始成沉舟侧畔"

num_list = []
content_len = len(content)
i = 0
flag = False
j = 0
while i < content_len:
    if content[i].isdigit():
        if not flag:
            flag = True
            j = i
        i = i + 1
    else:
        if flag:
            flag = False
            num_list.append(content[j:i])
        i = i + 1

print(num_list)


# 6、 使用两种方法在控制台打印出如下内容：例
# https://match.yuanrenxue.com/?page=1&token=\t
# https://match.yuanrenxue.com/?page=2&token=\t
# https://match.yuanrenxue.com/?page=3&token=\t
# 此处省略一堆。。。。。
# https://match.yuanrenxue.com/?page=100&token=\t

# for i in range(1, 101):
#     print("https://match.yuanrenxue.com/?page=%d&token=\t" % i)


# i = 1
# while i <= 100:
#     print("https://match.yuanrenxue.com/?page=%d&token=\t" % i)
#     i = i + 1

# 7、 实现功能：输入任意一段字符串，输出这个字符串是否为一个网址，例：
# 1.     输入：http://www.baidu.com
# 2.     输出：输入的字符串是一个网站
# 3.     输入：猿人学
# 4.     输出：输入的字符串不是一个网站

break_flag = False
text = input("输入:")
if text.startswith("http://"):
    if len(text) <= len("http://"):
        print("驶入字符串不是一个网站")
    uri = text[len("http://"):]
    uri_list = uri.split(".")
    for name in uri_list:
        if not name:
            print("输入字符串不是一个网站")
        for char in name:
            if (not char.isalnum()) and char != "-" and char != '/':
                break_flag = True
        if break_flag:
            break
    if break_flag:
        print("输入字符串不是一个网站")
    else:
        print("输入字符串是一个网站")
else:
    print("输入字符串不是一个网站")

text.isidentifier()







